code_snippets/8JiWTcEG.xml.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><GetFares xmlns="http://tempuri.org/"><Login><OverideLogging xmlns="HitchHiker.FlightAPI.SharedStructs">0</OverideLogging><Password xmlns="HitchHiker.FlightAPI.SharedStructs">My35p5ep</Password><TransactionID xmlns="HitchHiker.FlightAPI.SharedStructs">BLUDEV-4230TT2-130423-A0067</TransactionID><UserName xmlns="HitchHiker.FlightAPI.SharedStructs">bluloyalty.test</UserName><WEBData xmlns="HitchHiker.FlightAPI.SharedStructs"><Affiliate xsi:nil="true" /><AgencyID xsi:nil="true" /><CustomerID xsi:nil="true" /><ProcessID xsi:nil="true" /><UserIP xsi:nil="true" /><WEB xsi:nil="true" /><WEBPW xsi:nil="true" /><WEBTransactionID xsi:nil="true" /><WEBUser xsi:nil="true" /></WEBData></Login><request><Carriers xmlns="HitchHiker.FlightAPI.FareRequestStructs" /><Configuration xmlns="HitchHiker.FlightAPI.FareRequestStructs"><AdditionalDetails>None</AdditionalDetails><AllotmentConfig><Account xmlns="HitchHiker.FlightAPI.SharedStructs"><Database xsi:nil="true" /><Password xsi:nil="true" /><User xsi:nil="true" /></Account><AffiliateCode xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><EnhancedSearch xmlns="HitchHiker.FlightAPI.SharedStructs">Off</EnhancedSearch><Identifier xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><IgnoreAllDeadlines xmlns="HitchHiker.FlightAPI.SharedStructs">false</IgnoreAllDeadlines><MatchCode xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><OnlyAllotments xmlns="HitchHiker.FlightAPI.SharedStructs">false</OnlyAllotments><Priority xmlns="HitchHiker.FlightAPI.SharedStructs">All</Priority><Programs xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><RefillmentType xmlns="HitchHiker.FlightAPI.SharedStructs">None</RefillmentType><Supplier xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><Type xmlns="HitchHiker.FlightAPI.SharedStructs">None</Type></AllotmentConfig><AllowMultiTicketBookings>false</AllowMultiTicketBookings><AllowWaitList>false</AllowWaitList><Branch xsi:nil="true" /><BranchGroup xsi:nil="true" /><BrandNameFilter xsi:nil="true" /><BrandNameFilterExclude>false</BrandNameFilterExclude><CRSSettings><CRSData xmlns="HitchHiker.FlightAPI.SharedStructs"><GDS>1A</GDS><GUID xsi:nil="true" /><ReceivedFrom>BLU</ReceivedFrom><TerminalCountry>SA</TerminalCountry><TerminalPCC>BEYLB38A7</TerminalPCC><User>WSHIKHIK</User><ID>0</ID><UseMultiChannel>false</UseMultiChannel></CRSData></CRSSettings><Cache /><CalculationInput /><CurrencyCode>EUR</CurrencyCode><DBCodes /><EnableDebugCalculation>false</EnableDebugCalculation><EnableDebugSalesPreference>false</EnableDebugSalesPreference><ExtraInfo>None</ExtraInfo><FareDiversity>None</FareDiversity><FixedStay>false</FixedStay><LanguageCode>EN</LanguageCode><MaxElapsedFlightTime>0</MaxElapsedFlightTime><MergeMCT /><NumberOfPaymentRequests>0</NumberOfPaymentRequests><POTsFromMCRERoutingActionLeg xsi:nil="true" /><PaymentFilters /><PaymentInfo>None</PaymentInfo><PointOfSale xsi:nil="true" /><RestrictOvernight>0</RestrictOvernight><ReturnFlightsWithBaggageOnly>false</ReturnFlightsWithBaggageOnly><ReturnNonStopFlightsOnly>AllFlight</ReturnNonStopFlightsOnly><ReturnSeats>false</ReturnSeats><ReturnTicketlessCarrier>false</ReturnTicketlessCarrier><SalesPreferenceInput><Branch xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><BranchGroup xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><Level xmlns="HitchHiker.FlightAPI.SharedStructs">0</Level><LevelTitle xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><WEB xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /></SalesPreferenceInput><SpecialDiscounts>NoDiscountedFares</SpecialDiscounts><ToleranceSearchMode>Default</ToleranceSearchMode><VayantConfig><AgencyID xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><IATANumber xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><PointOfSale xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><SupplierName xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><UserName xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /></VayantConfig></Configuration><Fare xmlns="HitchHiker.FlightAPI.FareRequestStructs"><Charter><Accounts /><ConcurrentAvailabilities>0</ConcurrentAvailabilities><MaximumAvailabilities>0</MaximumAvailabilities><NumberOfAvailableFares>0</NumberOfAvailableFares><NumberOfCharterFares>0</NumberOfCharterFares><Touroperators /></Charter><GDSFares><CorporateCodes xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><FareSelectionCurrency xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><GDSTypes xmlns="HitchHiker.FlightAPI.SharedStructs">Published</GDSTypes><NumberOfFares xmlns="HitchHiker.FlightAPI.SharedStructs">30</NumberOfFares><PercentageFareOption xmlns="HitchHiker.FlightAPI.SharedStructs">NoPercentages</PercentageFareOption><PercentagesData xmlns="HitchHiker.FlightAPI.SharedStructs" /><BrandedFares xmlns="HitchHiker.FlightAPI.RequestStructs">Off</BrandedFares><ExtendedFareGroupBags xmlns="HitchHiker.FlightAPI.RequestStructs" /><FareGroups xsi:nil="true" xmlns="HitchHiker.FlightAPI.RequestStructs" /></GDSFares><Net><AvailabilitySearchMode>None</AvailabilitySearchMode><CalcModel xsi:nil="true" /><CheckAvailability>None</CheckAvailability><CheckTax>NoTaxForecast</CheckTax><DatabaseRecordsets xsi:nil="true" /><EnhancedFeederSearchConfig><EFSearchMaxMoveDowns xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><EFSearchMode xmlns="HitchHiker.FlightAPI.SharedStructs">None</EFSearchMode><MaxConnectionTime xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><MinConnectionTime xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /></EnhancedFeederSearchConfig><FillWithPublishedFares>false</FillWithPublishedFares><MatchCodes xsi:nil="true" /><MaximumConnections>0</MaximumConnections><MaximumNumberOfNetFares>0</MaximumNumberOfNetFares><NumberOfNetFares>0</NumberOfNetFares><ReturnFromPathfinder>false</ReturnFromPathfinder><ReturnNonAvailFares>Default</ReturnNonAvailFares><SplitConnectionsToFares>Default</SplitConnectionsToFares><StartFareNumber>0</StartFareNumber><TariffSubType>None</TariffSubType><TariffType>None</TariffType><UserDefinedFieldDetailLevel /><XtremePricerConfig><XPConcurrentAvails xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><XPMaxConnections xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><XPMaxMoveDowns xmlns="HitchHiker.FlightAPI.SharedStructs">0</XPMaxMoveDowns><XPSearchMode xmlns="HitchHiker.FlightAPI.SharedStructs">None</XPSearchMode></XtremePricerConfig></Net><Vayant><AllowAirportChange xmlns="HitchHiker.FlightAPI.SharedStructs">false</AllowAirportChange><AllowSplitTicket xmlns="HitchHiker.FlightAPI.SharedStructs">None</AllowSplitTicket><MCTMultiplier xmlns="HitchHiker.FlightAPI.SharedStructs">0</MCTMultiplier><MaxConnectTime xmlns="HitchHiker.FlightAPI.SharedStructs">0</MaxConnectTime><NumberOfFares xmlns="HitchHiker.FlightAPI.SharedStructs">0</NumberOfFares><PointOfSales xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /><VayantFareSource xmlns="HitchHiker.FlightAPI.SharedStructs" /><CheckAvailability>None</CheckAvailability></Vayant><Web><Country>LB</Country><NumberOfWebFares>30</NumberOfWebFares><PromotionalCodes xsi:nil="true" /><ReturnEstimatedResults>false</ReturnEstimatedResults><RoutingType>Default</RoutingType><WebAgents /></Web></Fare><Legs xmlns="HitchHiker.FlightAPI.FareRequestStructs"><FareRequestLeg><ArrivalDate>2023-12-24T00:00:00</ArrivalDate><ArrivalSearchRadius>0</ArrivalSearchRadius><ArrivalTime xsi:nil="true" /><Arrivals><string xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">BCN</string></Arrivals><Class>Economy</Class><Connections /><DepartureDate>2023-12-22T00:00:00</DepartureDate><DepartureSearchRadius>0</DepartureSearchRadius><DepartureTime xsi:nil="true" /><Departures><string xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">MAD</string></Departures><DisableArrivalCodeTranslation>false</DisableArrivalCodeTranslation><DisableDepartureCodeTranslation>false</DisableDepartureCodeTranslation><FlightNumbers xsi:nil="true" /><Stay><CheckDaysAhead>0</CheckDaysAhead><CheckDaysBack>0</CheckDaysBack></Stay></FareRequestLeg></Legs><Passengers xmlns="HitchHiker.FlightAPI.FareRequestStructs"><FareRequestPassenger><ForcePassengerType>false</ForcePassengerType><FreePassengerType xsi:nil="true" /><FrequentFlyerCards xsi:nil="true" /><Number>1</Number><Type>Adult</Type></FareRequestPassenger></Passengers><Pricing xmlns="HitchHiker.FlightAPI.FareRequestStructs"><MaximumFarePrice><CurrencyCode xsi:nil="true" xmlns="HitchHiker.FlightAPI.SharedStructs" /></MaximumFarePrice></Pricing></request></GetFares></soap:Body></soap:Envelope>